# importing Library

In [1]:
import numpy as np
import pandas as pd

# Importing Dataframe

In [2]:
df=pd.read_csv("cars.csv")

In [3]:
df.sample(5)

           brand  km_driven    fuel         owner  selling_price
5659      Maruti      72000  Diesel   First Owner         565000
1047     Renault      21000  Petrol   First Owner         290000
1637      Toyota      80000  Diesel  Second Owner         285000
3065  Volkswagen     120000  Diesel  Second Owner         425000
7664     Hyundai      60000  Diesel   First Owner         965000

# 1. OneHotEncoding using Pandas

one hot encode only Feul and Owner colums 

The brand colums has a lot of categories to we one hot encode this in Last

In [4]:
df.fuel.value_counts()    # we have 4 categories in the fuel so we can onehotEncode them

Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: fuel, dtype: int64

In [5]:
df.owner.value_counts()  # we have 5 categories in the owner  so we can onehotEncode them

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

In [6]:
pd.get_dummies(df,columns=['fuel','owner'])  # both columns are onehot encoaded

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

# 2. K-1 OneHotEncoding

we need to -1 from the catagories because of MULTICOLINIARITY

In [7]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True)  # droping the first  colum from each given column

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

# 3. OneHotEncoding using Sklearn

### 3.1 Train Test Split

we need to seperate data in train and test before doing onehotEncoding

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
X_train,X_test,y_train,y_test= train_test_split(df.drop('selling_price',axis=1),  #seperate input and output variables  for x and y 
                                               df['selling_price'],test_size=0.2,random_state=2)

In [10]:
X_train.head()

         brand  km_driven    fuel         owner
5571   Hyundai      35000  Diesel   First Owner
2038      Jeep      60000  Diesel   First Owner
2957   Hyundai      25000  Petrol   First Owner
7618  Mahindra     130000  Diesel  Second Owner
6684   Hyundai     155000  Diesel   First Owner

In [11]:
y_train.head()

5571    1150000
2038    1689999
2957     580000
7618     150000
6684     320000
Name: selling_price, dtype: int64

### 3.2 OneHotEncoding

In [12]:
from sklearn.preprocessing import OneHotEncoder   # importing the library

Creating an object of onehotEncoder 

we are droping first colums of each given  colums to avoid Multicolianerity 

sparse=false means it wiil  give us an arary 

np.int32 means that all the values for array shoud be integer by default it is float

In [13]:
ohe = OneHotEncoder(drop='first',sparse=False,dtype=np.int32)

fitting and trasforming the X_train data

In [14]:
X_train_new = ohe.fit_transform(X_train[['fuel','owner']])
X_test_new = ohe.fit_transform(X_test[['fuel','owner']])

D:\Users\USER\anaconda3\Lib\site-packages\sklearn\preprocessing\_encoders.py:868: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(
D:\Users\USER\anaconda3\Lib\site-packages\sklearn\preprocessing\_encoders.py:868: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [15]:
X_train_new  # we recived an array of integers (onehotEncoding Succesfull)

array([[1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0]])

In [16]:
X_test_new  # we recived an array of integers (onehotEncoding Succesfull)

array([[0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0]])

### 3.3Transforming X_train and X_train_new into one  data frame

In [17]:
X_train

         brand  km_driven    fuel         owner
5571   Hyundai      35000  Diesel   First Owner
2038      Jeep      60000  Diesel   First Owner
2957   Hyundai      25000  Petrol   First Owner
7618  Mahindra     130000  Diesel  Second Owner
6684   Hyundai     155000  Diesel   First Owner
...        ...        ...     ...           ...
3606      Ford      35000  Diesel   First Owner
5704    Maruti     120000  Petrol   First Owner
6637      Tata      15000  Petrol   First Owner
2575    Maruti      32500  Diesel  Second Owner
7336     Isuzu     121000  Diesel   First Owner

[6502 rows x 4 columns]

In [18]:
np.hstack((X_train[['brand','km_driven']].values,X_train_new))  # we  dont need  of fuel and owner so we drop that colum from X_train

array([['Hyundai', 35000, 1, ..., 0, 0, 0],
       ['Jeep', 60000, 1, ..., 0, 0, 0],
       ['Hyundai', 25000, 0, ..., 0, 0, 0],
       ...,
       ['Tata', 15000, 0, ..., 0, 0, 0],
       ['Maruti', 32500, 1, ..., 1, 0, 0],
       ['Isuzu', 121000, 1, ..., 0, 0, 0]], dtype=object)

THIS IS ONEHOTENCODED ARRAY

# 4. OneHotEncoding with Top Categories

if we have too many categories so the colums are also too many this problem mat take huge time to  load the data frame and to Analyze the the data 

so we have to select the categories with high values and remaining categories mat concat in single colum named outhers

In [19]:
df.brand.value_counts()  # like this we have so many categories in the brand colums

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

we want to take that brand which have min 100 values in it the outher brands we concate all with named outhers

In [27]:
threshold=100

counts = df['brand'].value_counts()

In [28]:
counts

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [34]:
repl = counts[counts <= threshold].index  # these are all the brands which have less than 100 values in data set

In [35]:
repl

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Force', 'Land', 'Isuzu', 'Kia',
       'Ambassador', 'Daewoo', 'MG', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object')

In [36]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon')).sample(5)  # we onehot encoded only brand colums and replace those brand to uncommon which have less values than 100

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
1828,0,0,0,0,0,0,0,0,0,0,0,0,1
1032,0,0,0,0,1,0,0,0,0,0,0,0,0
7016,0,0,0,0,0,0,1,0,0,0,0,0,0
7707,0,0,0,0,0,0,0,0,0,0,1,0,0
3792,0,0,0,0,0,1,0,0,0,0,0,0,0